googlecontacts/googlecontacts-connector/googlecontacts-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/googlecontacts/esb_retrieveSingleContactGroup_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.googlecontacts">
   <soapenv:Header/>
   <soapenv:Body>
	<urn:retrievesinglecontactgroup>	
      <urn:appName>%s(appName)</urn:appName>
      <urn:userEmail>%s(userEmail)</urn:userEmail>      
      <urn:accessToken>%s(accessToken)</urn:accessToken>	  
      <urn:groupId>%s(groupId)</urn:groupId>
	  <urn:method>retrieveSingleContactGroup</urn:method>
	 </urn:retrievesinglecontactgroup>	 
   </soapenv:Body>
</soapenv:Envelope>